zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/atdf/PIC32CZ2038CA70064.atdf
        <register caption="Output Write Disable" name="PORT_OWDR" offset="0x00A4" rw="W" size="4" atomic-op="clear:PORT_OWSR">
          <bitfield caption="Output Write Disable" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Write Disable" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Write Disable" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Write Disable" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Write Disable" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Write Disable" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Write Disable" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Write Disable" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Write Disable" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Write Disable" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Write Disable" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Write Disable" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Write Disable" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Write Disable" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Write Disable" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Write Disable" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Write Disable" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Write Disable" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Write Disable" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Write Disable" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Write Disable" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Write Disable" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Write Disable" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Write Disable" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Write Disable" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Write Disable" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Write Disable" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Write Disable" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Write Disable" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Write Disable" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Write Disable" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Write Disable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Output Write Status Register" name="PORT_OWSR" offset="0x00A8" rw="R" size="4">
          <bitfield caption="Output Write Status" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Write Status" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Write Status" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Write Status" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Write Status" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Write Status" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Write Status" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Write Status" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Write Status" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Write Status" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Write Status" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Write Status" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Write Status" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Write Status" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Write Status" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Write Status" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Write Status" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Write Status" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Write Status" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Write Status" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Write Status" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Write Status" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Write Status" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Write Status" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Write Status" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Write Status" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Write Status" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Write Status" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Write Status" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Write Status" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Write Status" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Write Status" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Additional Interrupt Modes Enable Register" name="PORT_AIMER" offset="0x00B0" rw="W" size="4" atomic-op="set:PORT_AIMMR">
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x00000001" name="P0"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x00000002" name="P1"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x00000004" name="P2"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x00000008" name="P3"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x00000010" name="P4"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x00000020" name="P5"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x00000040" name="P6"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x00000080" name="P7"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x00000100" name="P8"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x00000200" name="P9"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x00000400" name="P10"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x00000800" name="P11"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x00001000" name="P12"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x00002000" name="P13"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x00004000" name="P14"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x00008000" name="P15"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x00010000" name="P16"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x00020000" name="P17"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x00040000" name="P18"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x00080000" name="P19"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x00100000" name="P20"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x00200000" name="P21"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x00400000" name="P22"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x00800000" name="P23"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x01000000" name="P24"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x02000000" name="P25"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x04000000" name="P26"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x08000000" name="P27"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x10000000" name="P28"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x20000000" name="P29"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x40000000" name="P30"/>
          <bitfield caption="Additional Interrupt Modes Enable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Additional Interrupt Modes Disable Register" name="PORT_AIMDR" offset="0x00B4" rw="W" size="4" atomic-op="clear:PORT_AIMMR">
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x00000001" name="P0"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x00000002" name="P1"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x00000004" name="P2"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x00000008" name="P3"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x00000010" name="P4"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x00000020" name="P5"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x00000040" name="P6"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x00000080" name="P7"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x00000100" name="P8"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x00000200" name="P9"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x00000400" name="P10"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x00000800" name="P11"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x00001000" name="P12"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x00002000" name="P13"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x00004000" name="P14"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x00008000" name="P15"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x00010000" name="P16"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x00020000" name="P17"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x00040000" name="P18"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x00080000" name="P19"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x00100000" name="P20"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x00200000" name="P21"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x00400000" name="P22"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x00800000" name="P23"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x01000000" name="P24"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x02000000" name="P25"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x04000000" name="P26"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x08000000" name="P27"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x10000000" name="P28"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x20000000" name="P29"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x40000000" name="P30"/>
          <bitfield caption="Additional Interrupt Modes Disable" mask="0x80000000" name="P31"/>
        </register>
