zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/atdf/PIC32CZ2038CA70064.atdf
        <register caption="Master Mode Register" name="TWI_MMR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Internal Device Address Size" mask="0x00000300" name="IADRSZ" values="TWI_MMR__IADRSZ"/>
          <bitfield caption="Master Read Direction" mask="0x00001000" name="MREAD"/>
          <bitfield caption="Device Address" mask="0x007F0000" name="DADR"/>
        </register>
        <register caption="Slave Mode Register" name="TWI_SMR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Slave Receiver Data Phase NACK enable" mask="0x00000001" name="NACKEN"/>
          <bitfield caption="SMBus Default Address" mask="0x00000004" name="SMDA"/>
          <bitfield caption="SMBus Host Header" mask="0x00000008" name="SMHH"/>
          <bitfield caption="Clock Wait State Disable" mask="0x00000040" name="SCLWSDIS"/>
          <bitfield caption="Slave Address Mask" mask="0x00007F00" name="MASK"/>
          <bitfield caption="Slave Address" mask="0x007F0000" name="SADR"/>
          <bitfield caption="Slave Address 1 Enable" mask="0x10000000" name="SADR1EN"/>
          <bitfield caption="Slave Address 2 Enable" mask="0x20000000" name="SADR2EN"/>
          <bitfield caption="Slave Address 3 Enable" mask="0x40000000" name="SADR3EN"/>
          <bitfield caption="Data Matching Enable" mask="0x80000000" name="DATAMEN"/>
        </register>
        <register caption="Internal Address Register" name="TWI_IADR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Internal Address" mask="0x00FFFFFF" name="IADR"/>
        </register>
        <register caption="Clock Waveform Generator Register" name="TWI_CWGR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Clock Low Divider" mask="0x000000FF" name="CLDIV"/>
          <bitfield caption="Clock High Divider" mask="0x0000FF00" name="CHDIV"/>
          <bitfield caption="Clock Divider" mask="0x00070000" name="CKDIV"/>
          <bitfield caption="TWD Hold Time Versus TWCK Falling" mask="0x3F000000" name="HOLD"/>
        </register>
        <register caption="Status Register" name="TWI_SR" offset="0x20" rw="R" size="4">
          <bitfield caption="Transmission Completed (cleared by writing TWI_THR)" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready (cleared by reading TWI_RHR)" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready (cleared by writing TWI_THR)" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Slave Read" mask="0x00000008" name="SVREAD"/>
          <bitfield caption="Slave Access" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access (cleared on read)" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error (cleared on read)" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Underrun Error (cleared on read)" mask="0x00000080" name="UNRE"/>
          <bitfield caption="Not Acknowledged (cleared on read)" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost (cleared on read)" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State" mask="0x00000400" name="SCLWS"/>
          <bitfield caption="End Of Slave Access (cleared on read)" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="Master Code Acknowledge (cleared on read)" mask="0x00010000" name="MCACK"/>
          <bitfield caption="Timeout Error (cleared on read)" mask="0x00040000" name="TOUT"/>
          <bitfield caption="PEC Error (cleared on read)" mask="0x00080000" name="PECERR"/>
          <bitfield caption="SMBus Default Address Match (cleared on read)" mask="0x00100000" name="SMBDAM"/>
          <bitfield caption="SMBus Host Header Address Match (cleared on read)" mask="0x00200000" name="SMBHHM"/>
          <bitfield caption="SCL Line Value" mask="0x01000000" name="SCL"/>
          <bitfield caption="SDA Line Value" mask="0x02000000" name="SDA"/>
        </register>
        <register caption="Interrupt Enable Register" name="TWI_IER" offset="0x24" rw="W" size="4" atomic-op="set:TWI_IMR">
          <bitfield caption="Transmission Completed Interrupt Enable" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready Interrupt Enable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready Interrupt Enable" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Slave Access Interrupt Enable" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access Interrupt Enable" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Underrun Error Interrupt Enable" mask="0x00000080" name="UNRE"/>
          <bitfield caption="Not Acknowledge Interrupt Enable" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost Interrupt Enable" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State Interrupt Enable" mask="0x00000400" name="SCL_WS"/>
          <bitfield caption="End Of Slave Access Interrupt Enable" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="Master Code Acknowledge Interrupt Enable" mask="0x00010000" name="MCACK"/>
          <bitfield caption="Timeout Error Interrupt Enable" mask="0x00040000" name="TOUT"/>
          <bitfield caption="PEC Error Interrupt Enable" mask="0x00080000" name="PECERR"/>
          <bitfield caption="SMBus Default Address Match Interrupt Enable" mask="0x00100000" name="SMBDAM"/>
          <bitfield caption="SMBus Host Header Address Match Interrupt Enable" mask="0x00200000" name="SMBHHM"/>
        </register>
        <register caption="Interrupt Disable Register" name="TWI_IDR" offset="0x28" rw="W" size="4" atomic-op="clear:TWI_IMR">
          <bitfield caption="Transmission Completed Interrupt Disable" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready Interrupt Disable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready Interrupt Disable" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Slave Access Interrupt Disable" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access Interrupt Disable" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error Interrupt Disable" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Underrun Error Interrupt Disable" mask="0x00000080" name="UNRE"/>
          <bitfield caption="Not Acknowledge Interrupt Disable" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost Interrupt Disable" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State Interrupt Disable" mask="0x00000400" name="SCL_WS"/>
          <bitfield caption="End Of Slave Access Interrupt Disable" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="Master Code Acknowledge Interrupt Disable" mask="0x00010000" name="MCACK"/>
          <bitfield caption="Timeout Error Interrupt Disable" mask="0x00040000" name="TOUT"/>
          <bitfield caption="PEC Error Interrupt Disable" mask="0x00080000" name="PECERR"/>
          <bitfield caption="SMBus Default Address Match Interrupt Disable" mask="0x00100000" name="SMBDAM"/>
          <bitfield caption="SMBus Host Header Address Match Interrupt Disable" mask="0x00200000" name="SMBHHM"/>
        </register>
        <register caption="Interrupt Mask Register" name="TWI_IMR" offset="0x2C" rw="R" size="4" atomic-op="read:TWI_IMR">
          <bitfield caption="Transmission Completed Interrupt Mask" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready Interrupt Mask" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready Interrupt Mask" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Slave Access Interrupt Mask" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access Interrupt Mask" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Underrun Error Interrupt Mask" mask="0x00000080" name="UNRE"/>
          <bitfield caption="Not Acknowledge Interrupt Mask" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost Interrupt Mask" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State Interrupt Mask" mask="0x00000400" name="SCL_WS"/>
          <bitfield caption="End Of Slave Access Interrupt Mask" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="Master Code Acknowledge Interrupt Mask" mask="0x00010000" name="MCACK"/>
          <bitfield caption="Timeout Error Interrupt Mask" mask="0x00040000" name="TOUT"/>
          <bitfield caption="PEC Error Interrupt Mask" mask="0x00080000" name="PECERR"/>
          <bitfield caption="SMBus Default Address Match Interrupt Mask" mask="0x00100000" name="SMBDAM"/>
          <bitfield caption="SMBus Host Header Address Match Interrupt Mask" mask="0x00200000" name="SMBHHM"/>
        </register>
        <register caption="Receive Holding Register" name="TWI_RHR" offset="0x30" rw="R" size="4">
          <bitfield caption="Master or Slave Receive Holding Data" mask="0x000000FF" name="RXDATA"/>
        </register>
